cases/diffusion/constant/aerosolProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      aerosolProperties;
}

aerosolModel    none;

submodels
{
    driftFluxModel
    {
        diffusion
        {
            type        HirschfelderCurtiss;
        }

        Brownian
        {
            type        none;
        }

        inertial
        {
            type        none;
        }
    }
}

